# ContainedInOtherLoops Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..ContainedInOtherLoops Property
BuiltInFailures..::..SketchFailures Class See Also
---
When creating an opening, you cannot sketch loops within other loops. The highlighted loop(s) are contained within another loop.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ContainedInOtherLoops { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContainedInOtherLoops As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ContainedInOtherLoops {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace